<?php

namespace App\Http\Controllers\e_request\pdf;

use App\Http\Controllers\Controller;
use Illuminate\Http\Request;

class mistake_form extends Controller
{
    public function mistakePDF()
    {
    
    $html='<html>
            <head>
            <meta charset="UTF-8">
            <meta name="viewport" content="width=device-width, initial-scale=1.0">
            <link rel="stylesheet" href="css/e_request/form_main.css">
            </head>
            <style>
            </style>
                <body>
                    <div class="mistake_header">
                    <div class="logo" style="margin-left:20px;">
                        <img style="width: 150px; height: 100px;margin-top:-10px;" src="images/turbotech.png">
                    </div>
                    <div class="namecompany" style="text-align:center;margin-top:-117px;">
                        <h1 style="font-size: 25px;">ក្រុមហ៊ុនធើបូថេក   ឯ.ក</h1>
                        <h1 style=" font-size: 19px; margin-top: 0;">TURBOTECH CO., LTD</h1>
                    </div> 
                    <div class="heading">
                        <h3 class="center">កិច្ចសន្យាទទួលស្គាល់កំហុស</h3>
                    </div>
                    <div class="p_text">
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ខ្ញុំបាទ/នាងខ្ញុំ...........................................................................................សញ្ជាតិ...................ភេទ.............
                        កំពុងបម្រើ<br>ការងារនៅនាយកដ្ធាន..............................................................................ក្នុងតួនាទីជា.................................................បច្ចុប្បន្ន<br>កាន់កាតបុគ្គលិកលេខ...........................................ទូរស័ព្ទលេខ.............................................................។ 
                        កាលពីថ្ងៃទី............ខែ...................ឆ្នាំ.........................វេលាម៉ោង.........................ខ្ញុំបាទ/នាងខ្ញុំបានប្រព្រឹត្តកំហុសដូចខាងក្រោម៖</p>
                        <p>..................................................................................................................................................................</p>
                        <p>..................................................................................................................................................................</p>
                        <p>..................................................................................................................................................................</p>
                        <p>..................................................................................................................................................................</p>
                        <p>..................................................................................................................................................................</p>
                        <p>..................................................................................................................................................................</p>
                        <p>..................................................................................................................................................................</p>
                    </div> 
                    <div class="heading">
                        <h3 class="center_heading">ខ្ញុំបាទ/នាងខ្ញុំ សូមសន្យាថា</h3>
                    </div>
                    <div class="p_text">
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ខ្ញុំបាទ/នាងខ្ញុំ សូមធ្វើកិច្ចសន្យាជាលាយលក្ខណ៍អក្សរ ជូ​នលោក........................................................................តួនាទីជា..................................................................................នៃនាយកដ្ធាន....................................................................................<br>របស់ ក្រុមហ៊ុន ធើបូថេក ឯ.ក ថាថ្ងៃក្រោយខ្ញុំបាទ/នាងខ្ញុំ ឈប់ប្រព្រឹត្តអំពើទាំងឡាយណាដែលធ្វើឲ្យមានភាពរាំងស្ទះដល់ដំណើរការអភិវឌ្ឍន៍របស់ក្រុមហ៊ុន ធើបូថេក ឯ.កទៀតហើយ។ ប្រសិនបើខ្ញុំបាទ/នាងខ្ញុំ មិនគោរពតាមកិច្ចសន្យានេះទេ ខ្ញុំបាទ/នាងខ្ញុំ សុខចិត្តទទួលទោសកំហុស នឹង ការចាត់ចែងតាមវិធានការរដ្ធបាលរបស់ធើបូថេក និង តាមផ្លូវច្បាប់នៃព្រះរាជាណាចក្រកម្ពុជាដោយគ្មានការតវ៉ាអ្វីឡើយ។</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;កិច្ចសន្យានេះធ្វើចប់នៅវេលាម៉ោង.................នាថ្ងៃទី.............ខែ..............ឆ្នាំ២០.....ដោយបានអានឲ្យសាមីខ្លូនស្ដាប់ឡើងវិញ ពិតជាត្រឹមត្រូវ និង យល់ព្រមផ្ដិតមេដៃស្ដាំទុកជាភស្តុតាងស្រាប់។</p>
                    </div>
                    <div class="signature">
                        <p>ធ្វើនៅថ្ងៃទី.........ខែ.........ឆ្នាំ២០២០</p>
                        <h3 class="heading" style="margin-right: 45px;">ស្នាមមេដៃស្ដាំសាមីខ្លួន</h3>
                        <div class="signature_box"></div>
                        <p style="margin-top: 5px;">ឈ្មោះ......................................................</p>
                    </div>
                    <p class="reminder"><b>បញ្ចាក់៖ </b>សូមថតចម្លងជួនសាមីបុគ្គលិកមួយច្បាប់ រក្សាទុកនៅនាយកដ្ឋានធនធានមនុស្សនិងរដ្ឋបាល ដើម្បីរក្សាទុក។</p>
                    <div class="footer">
                        <p​>&nbsp;&nbsp;ទម្រង់លិខិតទទួលស្គាល់កំហុស &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;TT-HRAD-RTP-FM-010-00</p>
                    </div>  
                    </div>
                </body>
            </html>';

            $config = [
                'mode' => '+aCJK',
                "autoScriptToLang" => true,
                "autoLangToFont" => true,
            ];
    
            $mpdf = new \Mpdf\Mpdf($config);
            $mpdf->WriteHTML($html);
            $filename = 'mistake.pdf';
            $mpdf->SetDisplayMode('fullwidth');
            // $mpdf->Output($filename, 'D');//download
            return $mpdf->Output($filename,'I');
    }
}

    

